app/controllers/chat_controller.rb

  def create
    #自分の持っているチャットルームを取得
    current_user_chat_rooms = ChatRoomUser.where(user_id: current_user.id).map(&:chat_room)
    #自分の持っているチャットルームからチャット相手のいるルームを探す
    chat_room = ChatRoomUser.where(chat_room: current_user_chat_rooms, user_id: params[:user_id]).map(&:chat_room).first
    #なければ作成する
    if chat_room.blank?
      #chat_roomsテーブルにレコードを作成
      chat_room = ChatRoom.create
      ChatRoomUser.create(chat_room: chat_room, user_id: current_user.id)
---
SELECT "chat_room_users".* FROM "chat_room_users" WHERE "chat_room_users"."chat_room_id" = 2 AND "chat_room_users"."user_id" = ?  [["user_id", 6]]
INSERT INTO "chat_rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-04-29 06:13:15.010510"], ["updated_at", "2021-04-29 06:13:15.010510"]]
INSERT INTO "chat_room_users" ("chat_room_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["chat_room_id", 2], ["user_id", 5], ["created_at", "2021-04-29 06:15:46.706718"], ["updated_at", "2021-04-29 06:15:46.706718"]]

	def show
		chat_room = ChatRoom.find_by(id: params[:id])
		@chat_room_user = chat_room.chat_room_users.where.not(user_id: current_user.id).first.user
		@chat_messages = ChatMessage.where(chat_room: chat_room).order(:created_at)
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "chat_room_users".* FROM "chat_room_users" WHERE "chat_room_users"."chat_room_id" = ? AND ("chat_room_users"."user_id" != ?) ORDER BY "chat_room_users"."id" ASC LIMIT ?  [["chat_room_id", 2], ["user_id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "chat_messages".* FROM "chat_messages" WHERE "chat_messages"."chat_room_id" = 2 ORDER BY "chat_messages"."created_at" ASC