app/controllers/matching_controller.rb

SELECT "reactions"."from_user_id" FROM "reactions" WHERE "reactions"."to_user_id" = ? AND "reactions"."status" = ?  [["to_user_id", 5], ["status", 0]]
SELECT "reactions".* FROM "reactions" WHERE "reactions"."to_user_id" = 5 AND "reactions"."from_user_id" = ? AND "reactions"."status" = ?  [["from_user_id", 6], ["status", 0]]
---
    def index
        got_reaction_user_ids = Reaction.where(to_user_id: current_user.id, status: 'like').pluck(:from_user_id)
        @match_users = Reaction.where(to_user_id: got_reaction_user_ids, from_user_id: current_user.id, status: 'like').map(&:to_user)